docs/loadtest-results/2026-07-27T09-57-16-487Z/k6-shard-0.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/loadtest.js
        output: -

     scenarios: (100.00%) 1 scenario, 110 max VUs, 1m17s max duration (incl. graceful stop):
              * burst_recovery: Up to 100.00 iterations/s for 47s over 5 stages (maxVUs: 30-110, gracefulStop: 30s)


running (0m01.0s), 000/030 VUs, 19 complete and 0 interrupted iterations
burst_recovery   [   2% ] 000/030 VUs  01.0s/47s  020.00 iters/s

running (0m02.0s), 000/030 VUs, 39 complete and 0 interrupted iterations
burst_recovery   [   4% ] 000/030 VUs  02.0s/47s  020.00 iters/s

running (0m03.0s), 000/030 VUs, 59 complete and 0 interrupted iterations
burst_recovery   [   6% ] 000/030 VUs  03.0s/47s  020.00 iters/s

running (0m04.0s), 000/030 VUs, 79 complete and 0 interrupted iterations
burst_recovery   [   8% ] 000/030 VUs  04.0s/47s  020.00 iters/s

running (0m05.0s), 000/030 VUs, 99 complete and 0 interrupted iterations
burst_recovery   [  11% ] 000/030 VUs  05.0s/47s  020.00 iters/s

running (0m06.0s), 000/030 VUs, 119 complete and 0 interrupted iterations
burst_recovery   [  13% ] 000/030 VUs  06.0s/47s  020.00 iters/s

running (0m07.0s), 000/030 VUs, 139 complete and 0 interrupted iterations
burst_recovery   [  15% ] 000/030 VUs  07.0s/47s  020.00 iters/s

running (0m08.0s), 000/030 VUs, 159 complete and 0 interrupted iterations
burst_recovery   [  17% ] 000/030 VUs  08.0s/47s  020.00 iters/s

running (0m09.0s), 000/030 VUs, 179 complete and 0 interrupted iterations
burst_recovery   [  19% ] 000/030 VUs  09.0s/47s  020.00 iters/s

running (0m10.0s), 000/030 VUs, 199 complete and 0 interrupted iterations
burst_recovery   [  21% ] 000/030 VUs  10.0s/47s  020.00 iters/s

running (0m11.0s), 000/030 VUs, 219 complete and 0 interrupted iterations
burst_recovery   [  23% ] 000/030 VUs  11.0s/47s  020.00 iters/s

running (0m12.0s), 000/030 VUs, 239 complete and 0 interrupted iterations
burst_recovery   [  26% ] 000/030 VUs  12.0s/47s  020.00 iters/s

running (0m13.0s), 000/030 VUs, 259 complete and 0 interrupted iterations
burst_recovery   [  28% ] 000/030 VUs  13.0s/47s  020.00 iters/s

running (0m14.0s), 000/030 VUs, 279 complete and 0 interrupted iterations
burst_recovery   [  30% ] 000/030 VUs  14.0s/47s  020.00 iters/s

running (0m15.0s), 000/030 VUs, 299 complete and 0 interrupted iterations
burst_recovery   [  32% ] 000/030 VUs  15.0s/47s  020.00 iters/s

running (0m16.0s), 001/030 VUs, 357 complete and 0 interrupted iterations
burst_recovery   [  34% ] 001/030 VUs  16.0s/47s  098.79 iters/s

running (0m17.0s), 001/030 VUs, 458 complete and 0 interrupted iterations
burst_recovery   [  36% ] 001/030 VUs  17.0s/47s  100.00 iters/s

running (0m18.0s), 001/030 VUs, 558 complete and 0 interrupted iterations
burst_recovery   [  38% ] 001/030 VUs  18.0s/47s  100.00 iters/s

running (0m19.0s), 001/030 VUs, 658 complete and 0 interrupted iterations
burst_recovery   [  40% ] 001/030 VUs  19.0s/47s  100.00 iters/s

running (0m20.0s), 000/030 VUs, 758 complete and 0 interrupted iterations
burst_recovery   [  43% ] 000/030 VUs  20.0s/47s  100.00 iters/s

running (0m21.0s), 001/030 VUs, 858 complete and 0 interrupted iterations
burst_recovery   [  45% ] 001/030 VUs  21.0s/47s  100.00 iters/s

running (0m22.0s), 000/030 VUs, 958 complete and 0 interrupted iterations
burst_recovery   [  47% ] 000/030 VUs  22.0s/47s  100.00 iters/s

running (0m23.0s), 000/030 VUs, 1058 complete and 0 interrupted iterations
burst_recovery   [  49% ] 000/030 VUs  23.0s/47s  100.00 iters/s

running (0m24.0s), 000/030 VUs, 1158 complete and 0 interrupted iterations
burst_recovery   [  51% ] 000/030 VUs  24.0s/47s  100.00 iters/s

running (0m25.0s), 000/030 VUs, 1258 complete and 0 interrupted iterations
burst_recovery   [  53% ] 000/030 VUs  25.0s/47s  100.00 iters/s

running (0m26.0s), 000/030 VUs, 1358 complete and 0 interrupted iterations
burst_recovery   [  55% ] 000/030 VUs  26.0s/47s  100.00 iters/s

running (0m27.0s), 000/030 VUs, 1419 complete and 0 interrupted iterations
burst_recovery   [  57% ] 000/030 VUs  27.0s/47s  021.83 iters/s

running (0m28.0s), 000/030 VUs, 1439 complete and 0 interrupted iterations
burst_recovery   [  60% ] 000/030 VUs  28.0s/47s  020.00 iters/s

running (0m29.0s), 000/030 VUs, 1459 complete and 0 interrupted iterations
burst_recovery   [  62% ] 000/030 VUs  29.0s/47s  020.00 iters/s

running (0m30.0s), 000/030 VUs, 1479 complete and 0 interrupted iterations
burst_recovery   [  64% ] 000/030 VUs  30.0s/47s  020.00 iters/s

running (0m31.0s), 000/030 VUs, 1499 complete and 0 interrupted iterations
burst_recovery   [  66% ] 000/030 VUs  31.0s/47s  020.00 iters/s

running (0m32.0s), 000/030 VUs, 1519 complete and 0 interrupted iterations
burst_recovery   [  68% ] 000/030 VUs  32.0s/47s  020.00 iters/s

running (0m33.0s), 000/030 VUs, 1539 complete and 0 interrupted iterations
burst_recovery   [  70% ] 000/030 VUs  33.0s/47s  020.00 iters/s

running (0m34.0s), 000/030 VUs, 1559 complete and 0 interrupted iterations
burst_recovery   [  72% ] 000/030 VUs  34.0s/47s  020.00 iters/s

running (0m35.0s), 000/030 VUs, 1579 complete and 0 interrupted iterations
burst_recovery   [  74% ] 000/030 VUs  35.0s/47s  020.00 iters/s

running (0m36.0s), 000/030 VUs, 1599 complete and 0 interrupted iterations
burst_recovery   [  77% ] 000/030 VUs  36.0s/47s  020.00 iters/s

running (0m37.0s), 000/030 VUs, 1619 complete and 0 interrupted iterations
burst_recovery   [  79% ] 000/030 VUs  37.0s/47s  020.00 iters/s

running (0m38.0s), 000/030 VUs, 1639 complete and 0 interrupted iterations
burst_recovery   [  81% ] 000/030 VUs  38.0s/47s  020.00 iters/s

running (0m39.0s), 000/030 VUs, 1659 complete and 0 interrupted iterations
burst_recovery   [  83% ] 000/030 VUs  39.0s/47s  020.00 iters/s

running (0m40.0s), 000/030 VUs, 1679 complete and 0 interrupted iterations
burst_recovery   [  85% ] 000/030 VUs  40.0s/47s  020.00 iters/s

running (0m41.0s), 000/030 VUs, 1699 complete and 0 interrupted iterations
burst_recovery   [  87% ] 000/030 VUs  41.0s/47s  020.00 iters/s

running (0m42.0s), 000/030 VUs, 1719 complete and 0 interrupted iterations
burst_recovery   [  89% ] 000/030 VUs  42.0s/47s  020.00 iters/s

running (0m43.0s), 000/030 VUs, 1739 complete and 0 interrupted iterations
burst_recovery   [  91% ] 000/030 VUs  43.0s/47s  020.00 iters/s

running (0m44.0s), 000/030 VUs, 1759 complete and 0 interrupted iterations
burst_recovery   [  94% ] 000/030 VUs  44.0s/47s  020.00 iters/s

running (0m45.0s), 000/030 VUs, 1779 complete and 0 interrupted iterations
burst_recovery   [  96% ] 000/030 VUs  45.0s/47s  020.00 iters/s

running (0m46.0s), 000/030 VUs, 1799 complete and 0 interrupted iterations
burst_recovery   [  98% ] 000/030 VUs  46.0s/47s  020.00 iters/s

running (0m47.0s), 000/030 VUs, 1819 complete and 0 interrupted iterations
burst_recovery   [ 100% ] 000/030 VUs  47.0s/47s  020.00 iters/s


  █ TOTAL RESULTS 

    CUSTOM
    signals_accepted_202...........: 986    20.986869/s
    signals_rate_limited_429.......: 833    17.730286/s
    signals_sampled_sent...........: 47     1.000388/s

    HTTP
    http_req_duration..............: avg=4.26ms min=686.8µs  med=2.47ms max=194.14ms p(50)=2.47ms p(95)=13.7ms  p(99)=24.28ms
      { expected_response:true }...: avg=4.26ms min=686.8µs  med=2.47ms max=194.14ms p(50)=2.47ms p(95)=13.7ms  p(99)=24.28ms
    http_req_failed................: 0.00%  0 out of 1819
    http_reqs......................: 1819   38.717155/s

    EXECUTION
    iteration_duration.............: avg=4.68ms min=848.52µs med=2.92ms max=194.5ms  p(50)=2.92ms p(95)=14.29ms p(99)=24.72ms
    iterations.....................: 1819   38.717155/s
    vus............................: 0      min=0         max=2 
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 2.0 MB 43 kB/s
    data_sent......................: 869 kB 19 kB/s



running (0m47.0s), 000/030 VUs, 1819 complete and 0 interrupted iterations
burst_recovery ✓ [ 100% ] 000/030 VUs  47s  020.00 iters/s